"\r\n### Question 1\r\n\r\nYour team is working on an API definition which will be deployed using the API gateway service. You then need to ensure that control is established on who can access the various resources within the API gateway. Which of the following can help ensure this security requirement is met?\r\n\r\nSelect one:\\\r\na. IAM Policies\\\r\nb. Resource Policies\\\r\nc. IAM Roles\\\r\nd. Key Policies\r\n\r\nThe correct answer is: IAM Policies\r\n\r\n### Question 2\r\n\r\nAs a developer you are looking at making use of AWS Cognito Sync. Which of the below are features of this service. Choose 2 answers from the options given below\r\n\r\nSelect one:\\\r\na. Cross-device syncing of application-related user data\\\r\nb. Synching of offline data back to AWS\\\r\nc. Sync data with DynamoDB\\\r\nd. Push Sync Notification\r\n\r\nThe correct answers are: Cross-device syncing of application-related user data, Push Sync Notification\r\n\r\n### Question 3\r\n\r\nYour team lead has finished creating a build project in the console. You have access to run the build but not to access the project. You want to specify a different source location for the build. How can you achieve this?\r\n\r\nSelect one:\\\r\na. Specify the new location of the build in the buildspec.yml file and issue the update-project command\\\r\nb. Specify the new location of the build in the buildspec.yml file and use the update-build command\\\r\nc. Issue the update project command and specify the new location of the build\\\r\nd. Specify the new location of the build in the buildspec.yml file and use the start-build command\r\n\r\nThe correct answer is: Specify the new location of the build in the buildspec.yml file and use the start-build command\r\n\r\n### Question 4\r\n\r\nAs a developer , you have enabled server logging on an S3 bucket. You have a simple static web page with CSS pages uploaded to the bucket which is 1 MB in total size. After a duration of 2 weeks , you come back and see that the size of the bucket has increased to 50MB. Which of the following could be a reason for this?\r\n\r\nSelect one:\\\r\na. This is the normal behaviour since the logs are being delivered to the same bucket\\\r\nb. You have enabled CRR on the bucket as well , that is why the space is being consumed\\\r\nc. Monitoring has been enabled for the bucket\\\r\nd. You have enabled Encryption on the bucket as well , that is why the space is being consumed\r\n\r\nThe correct answer is: This is the normal behaviour since the logs are being delivered to the same bucket\r\n\r\n### Question 5\r\n\r\nYou have developed an application that is putting custom metrics into Cloudwatch. You need to generate alarms on a 10 second interval based on the published metrics. Which of the following needs to be done to fulfil this requirement?\r\n\r\nSelect one:\\\r\na. Create standard resolution metrics\\\r\nb. Enable detailed monitoring\\\r\nc. Create high resolution metrics\\\r\nd. Enable basic monitoring\r\n\r\nThe correct answer is: Create high resolution metrics\r\n\r\n### Question 6\r\n\r\nWhich of the following programming languages are officially supported AWS SDk’s. Choose 2 answers from the options below\r\n\r\nSelect one or more:\\\r\na. C\\\r\nb. Lisp\\\r\nc. Ruby\\\r\nd. Python\r\n\r\nThe correct answers are: Ruby, Python\r\n\r\n### Question 7\r\n\r\nCompany A is writing 5 items to the products table every second. Each item is 20Kb in size. What would be the required provisioned write throughput for best performance? Choose the correct answer from the options below.\r\n\r\nSelect one:\\\r\na. 100\\\r\nb. 155\\\r\nc. 160\\\r\nd. 16\r\n\r\nThe correct answer is: 100\r\n\r\n### Question 8\r\n\r\nAs per the IAM decision logic what is the first step of access permissions for any resource in AWS. Choose the correct answer from the options below\r\n\r\nSelect one:\\\r\na. A default deny\\\r\nb. An explicit deny\\\r\nc. An allow\\\r\nd. An explicit allow\r\n\r\nThe correct answer is: A default deny\r\n\r\n### Question 9\r\n\r\nA company is making use of the Simple Notification service to send notifications to various subscribers for their service. There is a user requirement for the subscriber to only receive certain types of messages and not all messages published to the topic. How can you achieve this?\r\n\r\nSelect one:\\\r\na. By adding a filter policy to the topic\\\r\nb. Publish the messages to a Lambda function\\\r\nc. By adding an IAM policy to the topic\\\r\nd. Publish the messages to an SQS queue\r\n\r\nThe correct answer is: By adding a filter policy to the topic\r\n\r\n### Question 10\r\n\r\nCompany B is writing 10 items to the products table every second. Each item is 15.5Kb in size. What would be the required provisioned write throughput for best performance? Choose the correct answer from the options below.\r\n\r\nSelect one:\\\r\na. 16\\\r\nb. 10\\\r\nc. 160\\\r\nd. 155\r\n\r\nThe correct answer is: 160\r\n\r\n### Question 11\r\n\r\nYour team has been instructed to host a static web site in AWS. Your team has developed the web site and is now planning on using an S3 bucket to host the static web site. Which of the following are the minimum list of steps to host a static web site using an S3 bucket? Choose 3 answers from the options given below\r\n\r\nSelect one or more:\\\r\na. Configure an Index document\\\r\nb. Configure an Error document\\\r\nc. Enable web site hosting on the bucket\\\r\nd. Configure permissions for web site access\r\n\r\nThe correct answers are: Enable web site hosting on the bucket, Configure an Index document, Configure permissions for web site access\r\n\r\n### Question 12\r\n\r\nYour company is planning on using the Simple Storage service to host objects that will be accessed by users. There is a speculation that there would be roughly 6000 GET requests per second. Which of the following could be used to ensure optimal performance? Choose 2 answers from the options given below?\r\n\r\nSelect one or more:\\\r\na. Enable Cross Region Replication for the bucket\\\r\nb. Use hash key prefixes for the object keys\\\r\nc. Enable versioning for the objects\\\r\nd. Use a Cloudfront distribution in front of the S3 bucket\r\n\r\nThe correct answers are: Use a Cloudfront distribution in front of the S3 bucket, Use hash key prefixes for the object keys\r\n\r\n### Question 13\r\n\r\nA developer has written an application that will be deployed by a company. The application is used to read and write objects to an S3 bucket. It is expected that the number of reads could exceed 400 requests per second. What should the developer do to ensure that the requests are handled accordingly.\r\n\r\nSelect one:\\\r\na. Enable Cross region replication for the bucket\\\r\nb. Ensure that the application uses a hash prefix when writing the data to the bucket\\\r\nc. Ensure that the application uses a hash suffix when writing the data to the bucket\\\r\nd. Enable versioning for the underlying bucket\r\n\r\nThe correct answer is: Ensure that the application uses a hash prefix when writing the data to the bucket\r\n\r\n### Question 14\r\n\r\nWhich EC2 API call would you use to retrieve a list of Amazon Machine Images (AMIs)? Choose an answer from the options below\r\n\r\nSelect one:\\\r\na. GetAMls\\\r\nb. DescribeAMls\\\r\nc. DescribeInstances\\\r\nd. DescribeImages\r\n\r\nThe correct answer is: DescribeImages\r\n\r\n### Question 15\r\n\r\nYour company is developing an application that will primarily be used by users on their mobile devices. The users need to have the ability to authenticate themselves via identity providers such as Facebook. Which of the following service should be used for user management?\r\n\r\nSelect one:\\\r\na. AWS SAML\\\r\nb. AWS STS with IAM\\\r\nc. AWS Cognito\\\r\nd. AWS Federation\r\n\r\nThe correct answer is: AWS Cognito\r\n\r\n### Question 16\r\n\r\nYour company is developing an application that will primarily be used by users on their mobile devices. The users need to have the ability to authenticate themselves via identity providers through Security Assertion Markup Language 2.0 . Which of the following service should be used for user management?\r\n\r\nSelect one:\\\r\na. AWS Cognito Identity pools\\\r\nb. AWS STS with IAM\\\r\nc. AWS Security pools\\\r\nd. AWS IAM pools\r\n\r\nThe correct answer is: AWS Cognito Identity pools\r\n\r\n### Question 17\r\n\r\nYour company currently has an S3 bucket hosted in an AWS Account. It holds information that needs be accessed by a partner account. Which is the MOST secure way to allow the partner account to access the S3 bucket in your account. Choose 3 answers from the options given below\r\n\r\nSelect one or more:\\\r\na. Ensure the partner uses an external id when making the request\\\r\nb. Provide the ARN for the role to the partner account\\\r\nc. Ensure an IAM role is created which can be assumed by the partner account\\\r\nd. Ensure an IAM user is created which can be assumed by the partner account.\r\n\r\nThe correct answers are: Ensure an IAM role is created which can be assumed by the partner account, Ensure the partner uses an external id when making the request, Provide the ARN for the role to the partner account\r\n\r\n### Question 18\r\n\r\nYou’ve been asked to develop an application on the AWS Cloud. The application will be used to store confidential documents in an S3 bucket. You need to ensure that the bucket is defined in such a way that it does not accept objects that are not encrypted?\r\n\r\nSelect one:\\\r\na. Ensure a condition is set in the bucket policy.\\\r\nb. Ensure that a condition is set in an IAM policy.\\\r\nc. Enable MFA for the underlying bucket\\\r\nd. Enable CORS for the underlying bucket\r\n\r\nThe correct answer is: Ensure a condition is set in the bucket policy.\r\n\r\n### Question 19\r\n\r\nWhich of the following are the responsibility of AWS. Choose 2 answers from the options below\r\n\r\nSelect one or more:\\\r\na. Patching the OS on the running EC2 instance\\\r\nb. Virtualization Infrastructure\\\r\nc. Physical security of AWS data centers\\\r\nd. Managing security groups\r\n\r\nThe correct answers are: Virtualization Infrastructure, Physical security of AWS data centers\r\n\r\n### Question 20\r\n\r\nAn application is currently in production that makes calls to an AWS RDS Instance. The application consists of a reporting module and a transactional system. During high load times, the response time for the application used to get very high. This was being attributed to the number of queries being fired against the database system. Which of the following can be used to resolve the response time for the application?\r\n\r\nSelect one:\\\r\na. Place a cloudfront distribution in front of the database\\\r\nb. Enable Read Replica’s for the database\\\r\nc. Enable Multi-AZ for the database\\\r\nd. Move the database to DynamoDB\r\n\r\nThe correct answer is: Enable Read Replica’s for the database\r\n\r\n### Question 21\r\n\r\nYour company is planning on using the Simple Storage service to host objects that will be accessed by users. In order to ensure optimal performance when requests are made to get the objects from the bucket, which of the following is the right way to use define the keys for optimal performance?\r\n\r\nSelect one:\\\r\na. demoawsbucket/232a-2019-14-03-15-00-00/ Image1.jpg\\\r\nb. demoawsbucket/2019-14-03-15-00-00/Image1.jpg\\\r\nc. demoawsbucket/sample/232a-2019-14-03-15-00-00 Image1.jpg\\\r\nd. demoawsbucket/sample/ Image1.jpg\r\n\r\nThe correct answer is: demoawsbucket/232a-2019-14-03-15-00-00/ Image1.jpg\r\n\r\n### Question 22\r\n\r\nA company is storing sensitive data in their S3 bucket. The company policy states that all objects in the S3 bucket need to be encrypted at rest. Which of the following help ensure this policy is met?\r\n\r\nSelect one:\\\r\na. Deny permission to upload an object if the header does not include x-amz-server-side-encryption\\\r\nb. Deny permission to upload an object if the header does not include x-allow-encryption\\\r\nc. Deny permission to upload an object if the header includes x-allow-encryption\\\r\nd. Deny permission to upload an object if the header includes x-amz-server-side-encryption\r\n\r\nThe correct answer is: Deny permission to upload an object if the header does not include x-amz-server-side-encryption\r\n\r\n### Question 23\r\n\r\nA developer has created a script which access an S3 bucket. The script will run on an EC2 Instance at regular intervals. What is the authentication mechanism that should be employed to ensure that the script works as desired?\r\n\r\nSelect one:\\\r\na. Create an IAM user. Ensure the IAM user has access to the S3 bucket via IAM policies. Embed the Access keys as environment variables for the Instance.\\\r\nb. Create an IAM user. Ensure the IAM user has access to the S3 bucket via IAM policies. Embed the user name and password in the script\\\r\nc. Create an IAM Role. Ensure the IAM Role has access to the S3 bucket via IAM policies. Attach the role to the instance\\\r\nd. Create an IAM user. Ensure the IAM user has access to the S3 bucket via IAM policies. Embed the Access keys to the program.\r\n\r\nThe correct answer is: Create an IAM Role. Ensure the IAM Role has access to the S3 bucket via IAM policies. Attach the role to the instance\r\n\r\n### Question 24\r\n\r\nYou’ve been asked to migrate a static web site onto AWS. You have been told that the solution should be COST effective. Which of the following solutions would you consider?\r\n\r\nSelect one:\\\r\na. Deploy the web site using S3 static web site hosting\\\r\nb. Create an Opswork stack and deploy the web site\\\r\nc. Create an Elastic Beanstalk environment and deploy the web site\\\r\nd. Create an EC2 Instance and deploy the web site\r\n\r\nThe correct answer is: Deploy the web site using S3 static web site hosting\r\n\r\n### Question 25\r\n\r\nYou are using a custom tool known as POSTMAN to make API requests to resources in AWS. Part of the job of sending requests is to sign the request. Which of the following would you use to sign the API requests made to AWS?\r\n\r\nSelect one:\\\r\na. A private key file\\\r\nb. KMS keys\\\r\nc. Access Keys\\\r\nd. Your user name and password\r\n\r\nThe correct answer is: Access Keys\r\n\r\n### Question 26\r\n\r\nAs a developer, you are writing an application that will be hosted on an EC2 Instance. This application will interact with a queue defined using the Simple Queue service. The messages will appear in the queue during a 20-60 second time duration. Which of the following strategy should be used to effectively query the queue for messages?\r\n\r\nSelect one:\\\r\na. Use long polling\\\r\nb. Use FIFO queues\\\r\nc. Use dead letter queues\\\r\nd. Use short polling\r\n\r\nThe correct answer is: Use long polling\r\n\r\n### Question 27\r\n\r\nYou’ve just started development on an application that will make use of the ElastiCache service. You need to ensure that objects are cached but not kept inadvertently for a long time. Which of the following cache maintenance strategy would you employ for the cache service?\r\n\r\nSelect one:\\\r\na. Lazy Loading\\\r\nb. TTL\\\r\nc. Read Through\\\r\nd. Write Through\r\n\r\nThe correct answer is: TTL\r\n\r\n### Question 28\r\n\r\nA static web site has been hosted on a bucket and is now being accessed by users. One of the web pages javascript section has been changed to access data which is hosted in another S3 bucket. Now that same web page is no longer loading in the browser. Which of the following can help alleviate the error?\r\n\r\nSelect one:\\\r\na. Change the Bucket policy for the bucket to allow access from the other bucket\\\r\nb. Enable Replication so that the objects get replicated to the other bucket\\\r\nc. Enable versioning for the underlying S3 bucket.\\\r\nd. Enable CORS for the bucket\r\n\r\nThe correct answer is: Enable CORS for the bucket\r\n\r\n### Question 29\r\n\r\nA Developer has been asked to create an AWS Elastic Beanstalk environment for a production web application which needs to handle thousands of requests. Currently the dev environment is running on a t1 micro instance. How can the Developer change the EC2 instance type to m4.large?\r\n\r\nSelect one:\\\r\na. Change the instance type to m4.large in the configuration details page of the Create New Environment page.\\\r\nb. Change the instance type value for the environment to m4.large by using update autoscaling group CLI command.\\\r\nc. Create a configuration file in Amazon S3 with the instance type as m4.large and use the same during environment creation.\\\r\nd. Use CloudFormation to migrate the Amazon EC2 instance type of the environment from t1 micro to m4.large.\r\n\r\nThe correct answer is: Create a configuration file in Amazon S3 with the instance type as m4.large and use the same during environment creation.\r\n\r\n### Question 30\r\n\r\nYou have defined some custom policies in AWS. You need to test out the permissions assigned to those policies. Which of the following can be used for this purpose via the CLI? Choose 2 answers from the options given below\r\n\r\nSelect one or more:\\\r\na. simulate-custom-policy command\\\r\nb. Use the aws iam get-custom-policy command\\\r\nc. Get the context keys first\\\r\nd. Get the AWS IAM Access keys first\r\n\r\nThe correct answers are: Get the context keys first,\r\nsimulate-custom-policy command\r\n"