"\r\nToday we will see how to create a EBS snapshot and restore it to an EC2 instance.\r\n\r\nI have created a EC2 instance with a 8GB EBS volume and ssh-ed into it.\r\n\r\nI will create a file called `test.txt` and write some text to it.\r\n\r\n```\r\nHello there!\r\n```\r\n\r\n![ec2 instance initial state](./putty_qlAgu4vzc8.png)\r\n\r\nNow in the ec2 console go to [Volumes section](https://console.aws.amazon.com/ec2/v2/home#Volumes:)\r\n\r\nSelect your volume and click on actions -> Create snapshot\r\n\r\n![create snapshot click action](./chrome_RBlPr2kG9c.png)\r\n\r\nClick on the Create snapshot in the next screen you can give a description to the snapshot if you want.\r\n\r\n![give description and create snapshot](./chrome_atmHdcLDi5.png)\r\n\r\nSnapshot successfully created message will appear at the top of the screen.\r\n\r\nYou can see the snapshot in the [Snapshots section](https://console.aws.amazon.com/ec2/v2/home#Snapshots:) of the console.\r\n\r\nNow we will Terminate the instance which will also delete the volume attached to it.\r\n\r\n## Restoring from EBS Snapshots\r\n\r\nGo to the [Snapshots section](https://console.aws.amazon.com/ec2/v2/home#Snapshots:) of the EC2 console.\r\n\r\nSelect the snapshot you want to restore from and click on Actions -> Create Volume from snapshot.\r\n\r\nIn the Create Volume screen you can increase the size of the volume, Change the volume type and specify the IOPS and also change the availability zone.\r\n\r\nYou can modify the settings of the volume and then click on Create Volume.\r\n\r\n![create volume from snapshot](./chrome_PNB7HZtGjW.png)\r\n\r\nYou can see the prompt saying that the volume has been created successfully.\r\n\r\nYou can see the Successfully created volume in the [Volumes section](https://console.aws.amazon.com/ec2/v2/home#Volumes:) of the console.\r\n\r\n![create volume from snapshot success](./chrome_C24v0qFAi6.png)\r\n\r\n## Create a new instance and attach restored volume\r\n\r\nGo to instances section of the console and click on Launch Instances.\r\n\r\nMake sure your subnet is same as the subnet of the volume you are attaching.\r\n\r\nand Launch the instance.\r\n\r\n## Change the root volume to the restored volume\r\n\r\nAfter the instance is launched you can see the instance in the [Instances section](https://console.aws.amazon.com/ec2/v2/home#Instances:) of the console.\r\n\r\nStop the instance by selecting the instance and click on Actions -> Stop.\r\n\r\nwait for the instance to stop and then go to the [Volumes section](https://console.aws.amazon.com/ec2/v2/home#Volumes:) of the console.\r\n\r\nSelect the already attached volume and click on Actions -> Detach Volume.\r\n\r\nAfter it is detached you can delete the volume to stop incurring charges.\r\n\r\nNow select the volume we restored from and click on Actions -> Attach Volume.\r\n\r\nSelect the instance we stopped in the instance section box.\r\n\r\nChange the device name to /dev/sda1 and click on Attach Volume.\r\n\r\nNow go back to the [Instances section](https://console.aws.amazon.com/ec2/v2/home#Instances:) of the console and start the instance that we stopped.\r\n\r\nNow if we ssh into the instance we can see the file we created earlier.\r\n\r\n![ec2 instance after restore](./putty_ydj0VF1lf1.png)\r\n\r\nWe have successfully restored the volume from the snapshot.\r\n"